Terraform Plan Output:
```
data.oci_identity_compartment.parent: Reading...
data.oci_identity_compartment.parent: Read complete after 1s [id=ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q]
oci_identity_compartment.root: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaa5duoizz2qhnhvoxgzvlzw7rr2dsumwgjrat5fbmiyhguqa5a4rga]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_identity_compartment.core["hub"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaa5duoizz2qhnhvoxgzvlzw7rr2dsumwgjrat5fbmiyhguqa5a4rga"
      + defined_tags   = (known after apply)
      + description    = "Hub Compartment for the OpenLZ Project"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-hub"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

  # oci_identity_compartment.core["mgmt"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaa5duoizz2qhnhvoxgzvlzw7rr2dsumwgjrat5fbmiyhguqa5a4rga"
      + defined_tags   = (known after apply)
      + description    = "Management Compartment for the OpenLZ Project"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-mgmt"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

  # oci_identity_compartment.core["open01"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaa5duoizz2qhnhvoxgzvlzw7rr2dsumwgjrat5fbmiyhguqa5a4rga"
      + defined_tags   = (known after apply)
      + description    = "Operating Entity 01 Compartment for the OpenLZ Project"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-open01"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

  # oci_identity_compartment.core["open02"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaa5duoizz2qhnhvoxgzvlzw7rr2dsumwgjrat5fbmiyhguqa5a4rga"
      + defined_tags   = (known after apply)
      + description    = "Operating Entity 02 Compartment for the OpenLZ Project"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-open02"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

  # oci_identity_compartment.core["open03"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaa5duoizz2qhnhvoxgzvlzw7rr2dsumwgjrat5fbmiyhguqa5a4rga"
      + defined_tags   = (known after apply)
      + description    = "Operating Entity 03 Compartment for the OpenLZ Project"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-open03"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

  # oci_identity_compartment.core["security"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaa5duoizz2qhnhvoxgzvlzw7rr2dsumwgjrat5fbmiyhguqa5a4rga"
      + defined_tags   = (known after apply)
      + description    = "Security Compartment for the OpenLZ Project"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-security"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan_output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan_output.tfplan"

```